app/controllers/crawling_products_controller.rb

  def index
    @crawling_products = CrawlingProduct.all
---
SELECT "crawling_products".* FROM "crawling_products"

  def destroy
    @crawling_product.destroy
---
DELETE FROM "crawling_products" WHERE "crawling_products"."id" = ?  [["id", 2]]

    def set_crawling_product
      @crawling_product = CrawlingProduct.find(params[:id])
---
SELECT  "crawling_products".* FROM "crawling_products" WHERE "crawling_products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]