app/controllers/products_controller.rb

SELECT "crawling_products".* FROM "crawling_products"
---
  def products

    crawling_products = CrawlingProduct.all